# 06 Mengganti nama (label) kolom pada Data Frame

Import Modules

In [2]:
import pandas as pd 
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

In [4]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)),
                 columns=cols)

df

   A  B  C  D  E
0  3  3  8  7  5
1  5  4  5  9  2
2  2  3  6  8  9
3  1  2  5  7  9
4  2  8  9  9  4

Mengganti nama (label) untuk sebuah kolom pada Data Frame

In [5]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  3  3     8  7  5
1  5  4     5  9  2
2  2  3     6  8  9
3  1  2     5  7  9
4  2  8     9  9  4

Mengganti nama (label) untuk banyak kolom pada Data Frame

In [9]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     3       3  8     7  5
1     5       4  5     9  2
2     2       3  6     8  9
3     1       2  5     7  9
4     2       8  9     9  4